In [1]:
import numpy as np
import pandas as pd

In [2]:
label = ['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':100}

In [3]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(my_list, index=label)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr,index=label)

a    10
b    20
c    30
dtype: int32

In [6]:
pd.Series(d)

a     10
b     20
c    100
dtype: int64

In [9]:
pd.Series(data=label)

0    a
1    b
2    c
dtype: object

In [11]:
pd.Series([sum,print,len]) #we never use this -uncommon

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
ser1=pd.Series([1,2,3,4],index=['USA','CHINA','FRANCE','GERMANY'])

In [14]:
ser1

USA        1
CHINA      2
FRANCE     3
GERMANY    4
dtype: int64

In [15]:
ser2=pd.Series([1,2,3,4],index=['USA','CHINA','ITALY','JAPAN'])

In [16]:
ser2

USA      1
CHINA    2
ITALY    3
JAPAN    4
dtype: int64

In [18]:
ser1['USA']

1

In [19]:
ser2['JAPAN']

4

In [20]:
ser2['CANADA'] #error since its not in the series ..cannot find the key

KeyError: 'CANADA'

In [21]:
ser1+ser2 #operations based on index positions

CHINA      4.0
FRANCE     NaN
GERMANY    NaN
ITALY      NaN
JAPAN      NaN
USA        2.0
dtype: float64

# Data Frames

In [22]:
#PANDAS
from numpy.random import randn

In [23]:
np.random.seed(101)

In [24]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [25]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [26]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
type(df['W'])

pandas.core.series.Series

In [28]:
df.W #not recommended

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [29]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [31]:
df['new']=df['W']+df['Y']

In [32]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [34]:
df.drop('new',axis=1,inplace=True) #to ensure the column is deleted permanently

In [35]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.drop('E',axis=0,inplace=True)#dropping row E

In [39]:
df.shape #tupple

(4, 4)

In [40]:
#COLUMNS
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237

In [41]:
#ROWS #two methods of extraction- loc and iloc
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [42]:
df.iloc[2] #index based location here location of C is 2

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [43]:
df.loc['B','Y']

-0.8480769834036315

In [45]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [47]:
booldf= df>0

In [49]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [50]:
#OR a better way
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [51]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [52]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [54]:
resultdf=df[df['W']>0]

In [57]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [58]:
#all above statements in one
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
Name: X, dtype: float64

In [65]:
boolser=df['W']>0
result = df[boolser]
mycols=['Y','X']
result[mycols]  #just to see by breaking down..it is same operation as above

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872

In [67]:
df[(df['W']>0) & (df['Y']>0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [68]:
df.reset_index() # we hv to use inplace to make it permanent

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057

In [73]:
newind='CA NY WY OR '.split()

In [74]:
newind

['CA', 'NY', 'WY', 'OR']

In [75]:
df['States']= newind

In [76]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR

In [77]:
#set new index
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057

In [89]:
#Index levels
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index= list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [86]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [87]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [93]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [95]:
df.index.names=['Groups','Num']

In [96]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [100]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [103]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [104]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502